In [97]:
import pandas as pd

In [98]:
df = pd.DataFrame({
    'name': ['Aidar', 'Akti', 'Felix', 'Daniel'],
    'age' : [12, 20, 21, 22],
    'score' : [71, 24, 65,87]
})
df

     name  age  score
0   Aidar   12     71
1    Akti   20     24
2   Felix   21     65
3  Daniel   22     87

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [100]:
df[['name']]

     name
0   Aidar
1    Akti
2   Felix
3  Daniel

In [101]:
df['name']

0     Aidar
1      Akti
2     Felix
3    Daniel
Name: name, dtype: object

In [102]:
print(df.loc[2])
print(df.iloc[2])

name     Felix
age         21
score       65
Name: 2, dtype: object
name     Felix
age         21
score       65
Name: 2, dtype: object

In [103]:
df[df['age'] > 20]

     name  age  score
2   Felix   21     65
3  Daniel   22     87

In [104]:
df[df['score'] > 40]

     name  age  score
0   Aidar   12     71
2   Felix   21     65
3  Daniel   22     87

In [105]:
df['passed'] = df['score'] > 65

In [106]:
df['passed'] = df['passed'].map({True: 1, False: 0})

In [107]:
df

     name  age  score  passed
0   Aidar   12     71       1
1    Akti   20     24       0
2   Felix   21     65       0
3  Daniel   22     87       1

In [108]:
df['age_+_1'] = df['age'] + 1
df

     name  age  score  passed  age_+_1
0   Aidar   12     71       1       13
1    Akti   20     24       0       21
2   Felix   21     65       0       22
3  Daniel   22     87       1       23

In [109]:
df['age_plus_1'] = df['age'] + (df['age'] > 20)
df

     name  age  score  passed  age_+_1  age_plus_1
0   Aidar   12     71       1       13          12
1    Akti   20     24       0       21          20
2   Felix   21     65       0       22          22
3  Daniel   22     87       1       23          23

In [110]:
df[['age']]> 20

     age
0  False
1  False
2   True
3   True

In [111]:

df

     name  age  score  passed  age_+_1  age_plus_1
0   Aidar   12     71       1       13          12
1    Akti   20     24       0       21          20
2   Felix   21     65       0       22          22
3  Daniel   22     87       1       23          23

In [112]:
df['age']

0    12
1    20
2    21
3    22
Name: age, dtype: int64

In [113]:
df['age'] > 20

0    False
1    False
2     True
3     True
Name: age, dtype: bool

In [114]:
df['age'] = df['age'] + (df['age'] > 23)
print(df['age'])

0    12
1    20
2    21
3    22
Name: age, dtype: int64

In [115]:
df['score'].isna()

0    False
1    False
2    False
3    False
Name: score, dtype: bool

In [116]:
df.isna().sum()

name          0
age           0
score         0
passed        0
age_+_1       0
age_plus_1    0
dtype: int64

In [117]:
df["score"].fillna(df["score"].mean())

0    71
1    24
2    65
3    87
Name: score, dtype: int64

In [118]:
df.dropna()

     name  age  score  passed  age_+_1  age_plus_1
0   Aidar   12     71       1       13          12
1    Akti   20     24       0       21          20
2   Felix   21     65       0       22          22
3  Daniel   22     87       1       23          23

In [119]:
df.groupby("age")["score"].mean()

age
12    71.0
20    24.0
21    65.0
22    87.0
Name: score, dtype: float64

In [120]:
df.groupby("age").agg(
    avg_score=("score", "mean"),
    count=("score", "count")
)

     avg_score  count
age
12        71.0      1
20        24.0      1
21        65.0      1
22        87.0      1

In [121]:
df["age"].value_counts()
df["passed"].value_counts(normalize=True)

passed
1    0.5
0    0.5
Name: proportion, dtype: float64

In [122]:
data = pd.DataFrame({
    "student": ["Ann", "Bob", "Clara", "Dan", "Eva"],
    "math": [78, 85, 90, 65, 88],
    "english": [82, 79, 91, 70, 86],
    "age": [20, 21, 20, 22, 21]
})

In [123]:
d.tail()

  student  math  english  age
0     Ann    78       82   20
1     Bob    85       79   21
2   Clara    90       91   20
3     Dan    65       70   22
4     Eva    88       86   21

In [124]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  5 non-null      object
 1   math     5 non-null      int64
 2   english  5 non-null      int64
 3   age      5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [125]:
data.shape

(5, 4)

In [126]:
data['math'] > 80

0    False
1     True
2     True
3    False
4     True
Name: math, dtype: bool

In [ ]:
data['avg_score'] = data[['math']]

In [128]:
data.sort_values('avg_score', ascending=False)

  student  math  english  age  avg_score
0     Ann    78       82   20        NaN
1     Bob    85       79   21        NaN
2   Clara    90       91   20        NaN
3     Dan    65       70   22        NaN
4     Eva    88       86   21        NaN

In [129]:
data['avg_score']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: avg_score, dtype: float64

In [158]:
data['avg_score'] = (data['math'] + data['english']) / 2

In [159]:
data['avg_score'] = data['avg_score']

In [160]:
data

  student  math  english  age  avg_score
0     Ann    78       82   20       80.0
1     Bob    85       79   21       82.0
2   Clara    90       91   20       90.5
3     Dan    65       70   22       67.5
4     Eva    88       86   21       87.0